## Production: alarms 🚨
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                    NAME                                                    |
|--------|------------------------------------------------------------------------------------------------------------|
| delete | `aws_cloudwatch_metric_alarm.platform_gc_forms_etl_user_processed_record_anomaly`                          |
| add    | `aws_cloudwatch_metric_alarm.anomaly_detection[&quot;platform-gc-forms-etl-submissions-processed-record&quot;]`      |
|        | `aws_cloudwatch_metric_alarm.anomaly_detection[&quot;platform-gc-forms-etl-template-processed-record&quot;]`         |
|        | `aws_cloudwatch_metric_alarm.anomaly_detection[&quot;platform-gc-forms-etl-template-to-user-processed-record&quot;]` |
|        | `aws_cloudwatch_metric_alarm.anomaly_detection[&quot;platform-gc-forms-etl-user-processed-record&quot;]`             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.anomaly_detection["platform-gc-forms-etl-submissions-processed-record"] will be created
  + resource "aws_cloudwatch_metric_alarm" "anomaly_detection" {
      + actions_enabled                       = true
      + alarm_description                     = "Anomaly detection for 'data-lake/etl/gc-forms / processed-data/submissions / ProcessedRecordCount'"
      + alarm_name                            = "anomaly-platform-gc-forms-etl-submissions-processed-record"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanLowerOrGreaterThanUpperThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold_metric_id                   = "expected_value"
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "actual_value"
          + return_data = true
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "Dataset" = "processed-data/submissions"
                }
              + metric_name = "ProcessedRecordCount"
              + namespace   = "data-lake/etl/gc-forms"
              + period      = 86400
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(actual_value, 1)"
          + id          = "expected_value"
          + label       = "ProcessedRecordCount (Expected)"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_cloudwatch_metric_alarm.anomaly_detection["platform-gc-forms-etl-template-processed-record"] will be created
  + resource "aws_cloudwatch_metric_alarm" "anomaly_detection" {
      + actions_enabled                       = true
      + alarm_description                     = "Anomaly detection for 'data-lake/etl/gc-forms / processed-data/template / ProcessedRecordCount'"
      + alarm_name                            = "anomaly-platform-gc-forms-etl-template-processed-record"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanLowerOrGreaterThanUpperThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold_metric_id                   = "expected_value"
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "actual_value"
          + return_data = true
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "Dataset" = "processed-data/template"
                }
              + metric_name = "ProcessedRecordCount"
              + namespace   = "data-lake/etl/gc-forms"
              + period      = 86400
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(actual_value, 0.5)"
          + id          = "expected_value"
          + label       = "ProcessedRecordCount (Expected)"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_cloudwatch_metric_alarm.anomaly_detection["platform-gc-forms-etl-template-to-user-processed-record"] will be created
  + resource "aws_cloudwatch_metric_alarm" "anomaly_detection" {
      + actions_enabled                       = true
      + alarm_description                     = "Anomaly detection for 'data-lake/etl/gc-forms / processed-data/templateToUser / ProcessedRecordCount'"
      + alarm_name                            = "anomaly-platform-gc-forms-etl-template-to-user-processed-record"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanLowerOrGreaterThanUpperThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold_metric_id                   = "expected_value"
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "actual_value"
          + return_data = true
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "Dataset" = "processed-data/templateToUser"
                }
              + metric_name = "ProcessedRecordCount"
              + namespace   = "data-lake/etl/gc-forms"
              + period      = 86400
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(actual_value, 0.5)"
          + id          = "expected_value"
          + label       = "ProcessedRecordCount (Expected)"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_cloudwatch_metric_alarm.anomaly_detection["platform-gc-forms-etl-user-processed-record"] will be created
  + resource "aws_cloudwatch_metric_alarm" "anomaly_detection" {
      + actions_enabled                       = true
      + alarm_description                     = "Anomaly detection for 'data-lake/etl/gc-forms / processed-data/user / ProcessedRecordCount'"
      + alarm_name                            = "anomaly-platform-gc-forms-etl-user-processed-record"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanLowerOrGreaterThanUpperThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold_metric_id                   = "expected_value"
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "actual_value"
          + return_data = true
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "Dataset" = "processed-data/user"
                }
              + metric_name = "ProcessedRecordCount"
              + namespace   = "data-lake/etl/gc-forms"
              + period      = 86400
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(actual_value, 0.5)"
          + id          = "expected_value"
          + label       = "ProcessedRecordCount (Expected)"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_cloudwatch_metric_alarm.platform_gc_forms_etl_user_processed_record_anomaly will be destroyed
  # (because aws_cloudwatch_metric_alarm.platform_gc_forms_etl_user_processed_record_anomaly is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "platform_gc_forms_etl_user_processed_record_anomaly" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [] -> null
      - alarm_description                     = "'Platform / GC Forms' ETL job anomaly detection for the 'user' dataset." -> null
      - alarm_name                            = "platform-gc-forms-etl-user-processed-record-anomaly" -> null
      - arn                                   = "arn:aws:cloudwatch:ca-central-1:739275439843:alarm:platform-gc-forms-etl-user-processed-record-anomaly" -> null
      - comparison_operator                   = "LessThanLowerOrGreaterThanUpperThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      - evaluation_periods                    = 1 -> null
      - id                                    = "platform-gc-forms-etl-user-processed-record-anomaly" -> null
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - period                                = 0 -> null
      - tags                                  = {} -> null
      - tags_all                              = {
          - "CostCentre" = "PlatformDataLake"
          - "Terraform"  = "true"
        } -> null
      - threshold                             = 0 -> null
      - threshold_metric_id                   = "processed_records_expected" -> null
      - treat_missing_data                    = "notBreaching" -> null
        # (6 unchanged attributes hidden)

      - metric_query {
          - id          = "processed_records" -> null
          - period      = 0 -> null
          - return_data = true -> null
            # (3 unchanged attributes hidden)

          - metric {
              - dimensions  = {
                  - "Dataset" = "processed-data/user"
                } -> null
              - metric_name = "ProcessedRecordCount" -> null
              - namespace   = "data-lake/etl/gc-forms" -> null
              - period      = 86400 -> null
              - stat        = "Sum" -> null
              - unit        = "Count" -> null
            }
        }
      - metric_query {
          - expression  = "ANOMALY_DETECTION_BAND(processed_records, 0.5)" -> null
          - id          = "processed_records_expected" -> null
          - label       = "Processed Records (Expected)" -> null
          - period      = 0 -> null
          - return_data = true -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 4 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.glue_job_failure"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.anomaly_detection[\"platform-gc-forms-etl-submissions-processed-record\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.anomaly_detection[\"platform-gc-forms-etl-template-processed-record\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.anomaly_detection[\"platform-gc-forms-etl-template-to-user-processed-record\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.anomaly_detection[\"platform-gc-forms-etl-user-processed-record\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.glue_crawler_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.glue_etl_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.glue_job_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.cloudwatch_alarm_action"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.cloudwatch_ok_action"]

30 tests, 19 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
